# Data Transformation مهمة جداً
So far you have seen how to prepare data for analysis. This processis effect represents a reassembly of the data contained within a DataFrame, with possible additions by other DataFrame and removal of unwanted parts.  

Now begin with the __Second Stage__ of data manipulation: __Data Transformation__.  
After you arrange the form of data and their disposal within the data structure, it is important to transform their values. In fact, in this section you will see some common issues and the steps required to overcome them using functions of the pandas library.   

Some of these operations involve the presence of duplicate or invalid values, with possible removal or replacement. Other operations relate instead modifying indexes. Other steps include handling and processing the numerical values of the data  and also stings.

In [404]:
import pandas as pd

In [405]:
World_Cities = pd.read_csv('worldcities.csv')

In [406]:
World_Cities

                      City                   Country
0                Rovaniemi                   Finland
1                Steinkjer                    Norway
2                 Monterey  United States of America
3                     Kuta                 Indonesia
4                    Lovec                  Bulgaria
...                    ...                       ...
7317                De Aar              South Africa
7318  Kamensk Shakhtinskiy                    Russia
7319                 Sinop                    Turkey
7320              Tirupati                     India
7321              Huangshi                     China

[7322 rows x 2 columns]

### Removing Duplicates:
Duplicate rows might be present in a DataFrame for various reasons. In DataFrame of enormous size the detection of these rows can be very problematic. Alsoin this case, pandas provides us with a series of tools to analyze the duplicate data present in large data structures.

In [407]:
World_Cities.duplicated() #False 'World_Cities' has
# no duplicated rows

0       False
1       False
2       False
3       False
4       False
        ...
7317    False
7318    False
7319    False
7320    False
7321    False
Length: 7322, dtype: bool

In [408]:
dframe = pd.DataFrame({ 'color': ['white','white','red','red','white'],
... 'value': [2,1,3,3,2]})

In [409]:
dframe

   color  value
0  white      2
1  white      1
2    red      3
3    red      3
4  white      2

In [410]:
dframe.duplicated()

0    False
1    False
2    False
3     True
4     True
dtype: bool

The fact of having as the return value a Boolean Series can be useful in many cases, especially for the filtering. In fact, if you want to know what are the duplicated rows, just type the following:

In [411]:
dframe[dframe.duplicated()]

   color  value
3    red      3
4  white      2

In [412]:
!pwd

/Users/hussainfadlallah/Desktop/MyOwnBusiness/Data Scientist track/Data Analysis using Python/pandas in Depth

In [413]:
from pandas import ExcelWriter

In [414]:
pip install openpyxl

Requirement already satisfied: openpyxl in /opt/anaconda3/envs/myenv/lib/python3.8/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in /opt/anaconda3/envs/myenv/lib/python3.8/site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [415]:
iris.to_csv('Iris_Names.csv', index = False)

In [416]:
iris =  pd.read_csv('Iris_Names.csv', index_col=False )

In [417]:
iris

,Unnamed: 0,sepal_length,sepal_width,petal_length,petal_width,species
0,0,5.1,3.5,1.4,0.2,setosa
1,1,4.9,3.0,1.4,0.2,setosa
2,2,4.7,3.2,1.3,0.2,setosa
3,3,4.6,3.1,1.5,0.2,setosa
4,4,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...
145,145,6.7,3.0,5.2,2.3,virginica
146,146,6.3,2.5,5.0,1.9,virginica
147,147,6.5,3.0,5.2,2.0,virginica
148,148,6.2,3.4,5.4,2.3,virginica
149,149,5.9,3.0,5.1,1.8,virginica

In [418]:
iris.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Length: 150, dtype: bool

In [419]:
iris[iris.duplicated()] # because there is 
# Not any duplicated rows in the file ....

Empty DataFrame
Columns: [Unnamed: 0, sepal_length, sepal_width, petal_length, petal_width, species]
Index: []

In [420]:
iris

,Unnamed: 0,sepal_length,sepal_width,petal_length,petal_width,species
0,0,5.1,3.5,1.4,0.2,setosa
1,1,4.9,3.0,1.4,0.2,setosa
2,2,4.7,3.2,1.3,0.2,setosa
3,3,4.6,3.1,1.5,0.2,setosa
4,4,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...
145,145,6.7,3.0,5.2,2.3,virginica
146,146,6.3,2.5,5.0,1.9,virginica
147,147,6.5,3.0,5.2,2.0,virginica
148,148,6.2,3.4,5.4,2.3,virginica
149,149,5.9,3.0,5.1,1.8,virginica

Generally, all duplicated rows are to be deleted from the DataFrame; to do that, pandas provides the __drop_duplicates()__ function, which returns the DataFrame without duplicated rows.

In [421]:
iris.drop_duplicates()
# Nothing droped necause
# there is not duplicates in 'iris'

,Unnamed: 0,sepal_length,sepal_width,petal_length,petal_width,species
0,0,5.1,3.5,1.4,0.2,setosa
1,1,4.9,3.0,1.4,0.2,setosa
2,2,4.7,3.2,1.3,0.2,setosa
3,3,4.6,3.1,1.5,0.2,setosa
4,4,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...
145,145,6.7,3.0,5.2,2.3,virginica
146,146,6.3,2.5,5.0,1.9,virginica
147,147,6.5,3.0,5.2,2.0,virginica
148,148,6.2,3.4,5.4,2.3,virginica
149,149,5.9,3.0,5.1,1.8,virginica

### Mapping
The pandas library provides a set of functions which, as you shall see in this section, exploit mapping to perform some operations. The mapping is nothing more than the creation of a list of matches between two different values, with the ability to bind a value to a particular label or string.   

The functions that you will see in this section perform specific operations but all of them are united from accepting a dict object with matches as an argument.   
• replace(): replaces values  
• map():     creates a new column  
• rename():  replaces the index values

In [422]:
map = {
    'label1' : 1,
    'label2' : 2,
    'label3' : 3
}

In [423]:
map

{'label1': 1, 'label2': 2, 'label3': 3}

### Replacing values via Mapping
Often in the data structure that you have assembled there are values that do not meet your needs. For example, the text may be  in a forign language, or may be a synonym of another value, or may not be expressed in the desired shape. In such cases, a replace operation of various values is often a necessary process.  
Define, as an example, a DataFrame containing various objects and colors, including two colors that are not in English. Often during the assembly operations is likely to keep maintaining data with values in a form that is not desired.

In [424]:
frame = pd.DataFrame({ 'item':['ball','mug','pen','pencil','ashtray'],
... 'color':['white','rosso','verde','black','yellow'],
'price':[5.56,4.20,1.30,0.56,2.75]})

In [425]:
frame # rosso & verde are not in English language

      item   color  price
0     ball   white   5.56
1      mug   rosso   4.20
2      pen   verde   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

Thus to be able to replace the incorrect values in new values is necessary to define a mapping of correspondences, containing as key to replace the old values and values as the new ones.

In [426]:
newcolors = {
    'rosso' : 'red',
    'verde' : 'green'
}
frame.replace(newcolors)

      item   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

As you can see from the result, the two colors have been replaced with the correct values within the DataFrame. A common case, for example, is the replacement of the NaN values with another value, for example (0). Also here you can use the __replace()__, which performs its job very well.

In [427]:
import numpy as np

In [428]:
longframe = pd.DataFrame({ 'color':['white','white','white',
... 'red','red','red',
... 'black','black','black'],
... 'item':['ball','pen','mug',
... 'ball','pen','mug',
... 'ball','pen','mug'],
... 'value': np.random.rand(9)})

In [429]:
longframe

   color  item     value
0  white  ball  0.707344
1  white   pen  0.476416
2  white   mug  0.766438
3    red  ball  0.167292
4    red   pen  0.423779
5    red   mug  0.722793
6  black  ball  0.887541
7  black   pen  0.271878
8  black   mug  0.925644

In [430]:
wideframe = longframe.pivot(columns = 'item')

In [431]:
wideframe

      color                   value
item   ball    mug    pen      ball       mug       pen
0     white    NaN    NaN  0.707344       NaN       NaN
1       NaN    NaN  white       NaN       NaN  0.476416
2       NaN  white    NaN       NaN  0.766438       NaN
3       red    NaN    NaN  0.167292       NaN       NaN
4       NaN    NaN    red       NaN       NaN  0.423779
5       NaN    red    NaN       NaN  0.722793       NaN
6     black    NaN    NaN  0.887541       NaN       NaN
7       NaN    NaN  black       NaN       NaN  0.271878
8       NaN  black    NaN       NaN  0.925644       NaN

In [432]:
wideframe.replace(np.nan, 0.0)

      color                   value
item   ball    mug    pen      ball       mug       pen
0     white    0.0    0.0  0.707344  0.000000  0.000000
1       0.0    0.0  white  0.000000  0.000000  0.476416
2       0.0  white    0.0  0.000000  0.766438  0.000000
3       red    0.0    0.0  0.167292  0.000000  0.000000
4       0.0    0.0    red  0.000000  0.000000  0.423779
5       0.0    red    0.0  0.000000  0.722793  0.000000
6     black    0.0    0.0  0.887541  0.000000  0.000000
7       0.0    0.0  black  0.000000  0.000000  0.271878
8       0.0  black    0.0  0.000000  0.925644  0.000000

### Adding values via Mapping
In the previous section you have seen the case of the substitution of values through a mapping of correspondences. In this case you continue to ecploit the mapping of values with another example. In this case you are expoliting mapping to add values in a column depending on the values contained in another.   
The mapping will always be defined separately.

In [433]:
frame = pd.DataFrame({ 'item':['ball','mug','pen','pencil','ashtray'],
... 'color':['white','red','green','black','yellow']})

In [434]:
frame

      item   color
0     ball   white
1      mug     red
2      pen   green
3   pencil   black
4  ashtray  yellow

Let's suppose you want to add a column to indicate the price of the item shown in the DataFrame.   
Before you do this, it is a suumed that you have a price list avaliable somewhere, in which the price for each type of item is described. Define then a dect object that contains a list of prices for each type of them.

In [435]:
price = {
... 'ball' : 5.56,
... 'mug' : 4.20,
... 'bottle' : 1.30,
... 'scissors' : 3.41,
... 'pen' : 1.30,
... 'pencil' : 0.56,
... 'ashtray' : 2.75
... }
# adding column to a DataFrame

The __map()__ function applied to a Series or to a column of DataFrame accepts a function or an object containing a dict with mapping. So in your case you can apply the mapping of the prices on the column item, making sure to add a column to the price DataFrame

In [436]:
frame['price'] = frame['item'].map(price)

In [437]:
frame # price column added

      item   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

In [438]:
frame.drop('prices', axis=1)

KeyError: "['prices'] not found in axis"

### Renaming the Indexes of the Axes
Even the axis label can be transformed in a very similar way using the mapping. So to replace the label indexes, pandas provides the __rename()__ function, which takes the mapping as argument, that is, a dict object.

In [439]:
frame1 = frame.drop('prices', axis=1)

KeyError: "['prices'] not found in axis"

In [440]:
frame1

NameError: name 'frame1' is not defined

In [441]:
>>> reindex = {
... 0: 'first',
... 1: 'second',
... 2: 'third',
... 3: 'fourth',
... 4: 'fifth'}

In [442]:
reindex

{0: 'first', 1: 'second', 2: 'third', 3: 'fourth', 4: 'fifth'}

In [443]:
frame1.rename(reindex)
# the indexes are renamed

NameError: name 'frame1' is not defined

If you want to rename columns you must use the __columns__ option. Thus this time you assign various mapping explicitly to the two __index__ and __columns__ options.

In [444]:
recolumn = {
    'item' : 'object',
    'price' : 'value'
}

In [445]:
frame1.rename(index=reindex, columns=recolumn)
# item renamed to object / price renamed to value ...

NameError: name 'frame1' is not defined

In [446]:
frame1
# unchanged ....

NameError: name 'frame1' is not defined

So far you have seen that the __rename()__ function returns a DataFrame with the changes, leaving unchanged the original DataFrame. If you want the changes to take effect on the object on which you call the function, you will set the __inplace__ option to True.

In [447]:
frame1.rename(columns={'item':'object'}, inplace=True)

NameError: name 'frame1' is not defined

In [448]:
frame1

NameError: name 'frame1' is not defined

In [449]:
frame1 # changed ...

NameError: name 'frame1' is not defined

# Discretization and Binning:
A more complex process of transformation that you will see in this section is __Discretization__. Sometimes it can happen, especially in some experimental cases, to handle large quantities of data generated in sequence. To carry out an analysis of the data, however, it is necessary to transform this data into discrete categories, for example, by dividing the range of values of such readings in smaller intervals and counting the occurence or statistics within each of them.   
Another case might be to have a huge amount of samples due to precise readings on a population. Even here, to facilitate analysis of the data it is necessary to divide the range of values into categories and then analyze the ocurrences  and statistics related to each of them.    
In your case, for example, you may have a reading of an experimental value between 0 and 100. These data are collected in a list.

In [450]:
results = [12,34,67,55,28,90,99,12,3,56,74,44,87,23,49,89,87]

You know that the experimental values have a range from 0 to 100; therefore you can uniformly divide this intervals, for example, into four quarters, i.e., bins.   
The first contains the values between 0 and 25, the second between 26 to 50, the third between 51 to 75, and the fourth between 76 to 100.   
To do this binning with pandas, first you have to define  an array containing the values of separation of bin:

In [451]:
bins = [0,25,50,75,100]

Then there is a function called __cut()__ and apply it to the array of results also passing the bins.

In [452]:
import pandas as pd

In [453]:
cat = pd.cut(results, bins)

In [454]:
cat

[(0, 25], (25, 50], (50, 75], (50, 75], (25, 50], ..., (75, 100], (0, 25], (25, 50], (75, 100], (75, 100]]
Length: 17
Categories (4, interval[int64, right]): [(0, 25] < (25, 50] < (50, 75] < (75, 100]]

The object returned by the __cut()__ function is a special object of Categorical type.   
You can consider it as an array of strings indicating the name of the bin.    
Internally it contains a __(levels)__ array indicating the names of the different internal categories and a __(labels)__ array that contains a list of numbers equal to the elements of __(results)__(i.e, the array subjected to binning).   
The number corresponds to the bin to which the corresponding elements of the __(results)__ is assigned.

In [455]:
cat

[(0, 25], (25, 50], (50, 75], (50, 75], (25, 50], ..., (75, 100], (0, 25], (25, 50], (75, 100], (75, 100]]
Length: 17
Categories (4, interval[int64, right]): [(0, 25] < (25, 50] < (50, 75] < (75, 100]]

In [456]:
cat.categories

IntervalIndex([(0, 25], (25, 50], (50, 75], (75, 100]], dtype='interval[int64, right]')

Finally to know the occurences for each bin, that is, how many results fall into each category, you have to use the __value_counts()__ function.

In [457]:
pd.value_counts(cat)

(75, 100]    5
(0, 25]      4
(25, 50]     4
(50, 75]     4
Name: count, dtype: int64

In [458]:
pd.Series(cat)

0       (0, 25]
1      (25, 50]
2      (50, 75]
3      (50, 75]
4      (25, 50]
5     (75, 100]
6     (75, 100]
7       (0, 25]
8       (0, 25]
9      (50, 75]
10     (50, 75]
11     (25, 50]
12    (75, 100]
13      (0, 25]
14     (25, 50]
15    (75, 100]
16    (75, 100]
dtype: category
Categories (4, interval[int64, right]): [(0, 25] < (25, 50] < (50, 75] < (75, 100]]

In [459]:
cat.categories

IntervalIndex([(0, 25], (25, 50], (50, 75], (75, 100]], dtype='interval[int64, right]')

As you can see, each class has the lower limit with a bracket and the upper limit with a parenthesis.  
This notation is consistent with amthematical notation that is used to indicate the intervals.  
If the bracket is a square, the number belongs to the range (limit closed), and if it is round the number dose not belong to the interval (limit open).   
You can give names to various bins by calling them first in an array of strings and then assigning to the labels options inside the __cut()__ function that you have used to create the Categorical object.

In [460]:
bin_names = ['Unlikely','less likely', 'likely', 'highly likely']

In [461]:
pd.Series(pd.cut(results, bins, labels=bin_names))

0          Unlikely
1       less likely
2            likely
3            likely
4       less likely
5     highly likely
6     highly likely
7          Unlikely
8          Unlikely
9            likely
10           likely
11      less likely
12    highly likely
13         Unlikely
14      less likely
15    highly likely
16    highly likely
dtype: category
Categories (4, object): ['Unlikely' < 'less likely' < 'likely' < 'highly likely']

If the __cut()__ function is passed as an argument to an integer instead of explicating the bin edges, this will divide the range of values of the array in many intervals as specified by the number.   
The limits of the interval will be taken by the minimum of the sample data, namely, the array subjected to binning.

In [462]:
pd.Series(pd.cut(results, 5))

0     (2.904, 22.2]
1      (22.2, 41.4]
2      (60.6, 79.8]
3      (41.4, 60.6]
4      (22.2, 41.4]
5      (79.8, 99.0]
6      (79.8, 99.0]
7     (2.904, 22.2]
8     (2.904, 22.2]
9      (41.4, 60.6]
10     (60.6, 79.8]
11     (41.4, 60.6]
12     (79.8, 99.0]
13     (22.2, 41.4]
14     (41.4, 60.6]
15     (79.8, 99.0]
16     (79.8, 99.0]
dtype: category
Categories (5, interval[float64, right]): [(2.904, 22.2] < (22.2, 41.4] < (41.4, 60.6] < (60.6, 79.8] < (79.8, 99.0]]

In addition to __cut()__ function, pandas provides another method for binning: __qcut()__ .   
This function divides the sample directly into quintiles.  
In fact, depending on the distribution of the data sample, using __cut()__ rightly you will have a different number of ocuurences for each bin.  
Instead __qcut()__ will ensure that the number of occurences for each bin is equal, but the edges of each bin to vary.

In [463]:
quintiles = pd.qcut(results, 5)

In [464]:
pd.Series(quintiles)

0     (2.999, 24.0]
1      (24.0, 46.0]
2      (62.6, 87.0]
3      (46.0, 62.6]
4      (24.0, 46.0]
5      (87.0, 99.0]
6      (87.0, 99.0]
7     (2.999, 24.0]
8     (2.999, 24.0]
9      (46.0, 62.6]
10     (62.6, 87.0]
11     (24.0, 46.0]
12     (62.6, 87.0]
13    (2.999, 24.0]
14     (46.0, 62.6]
15     (87.0, 99.0]
16     (62.6, 87.0]
dtype: category
Categories (5, interval[float64, right]): [(2.999, 24.0] < (24.0, 46.0] < (46.0, 62.6] < (62.6, 87.0] < (87.0, 99.0]]

In [465]:
pd.value_counts(quintiles)

(2.999, 24.0]    4
(62.6, 87.0]     4
(24.0, 46.0]     3
(46.0, 62.6]     3
(87.0, 99.0]     3
Name: count, dtype: int64

As you can see, in the case of quintiles, the intervals bounding the bin differ from those generated by the __cut()__ function.  
Moreover, if you look at the occurences for each bin will find that __qcut()__ tried to standarize the occurences for each bin, but in the case of quintiles, the first two bins have an occurence in more because the number of results is not divisable by five.

In [466]:
import numpy as np

### Detecting and Filtering Outliers:
During the data analysis, the need to detect the presence of abnormal values within a data structure often arises. By way of example, create a DataFrame with three columns from 1000 completely random values:

In [467]:
randframe = pd.DataFrame(np.random.randn(1000,3))

In [468]:
randframe.describe()

                 0            1            2
count  1000.000000  1000.000000  1000.000000
mean      0.036638    -0.044763     0.012700
std       0.990575     0.988863     1.003312
min      -4.078494    -3.631927    -3.172382
25%      -0.609516    -0.701340    -0.640271
50%       0.048698    -0.036497    -0.036256
75%       0.743592     0.604760     0.660144
max       2.825579     3.145205     3.574846

For example, you might consider outliers those that have a _value greater than three times the standard deviation_.   
To have only the standard deviation of each column of the DataFrame, use the __std()__ function.

In [469]:
randframe.std()

0    0.990575
1    0.988863
2    1.003312
dtype: float64

Now you apply the filtering of all the values of the DataFrame, applying the corresponding standard devation for each column.  
Thanks to the __any()__ function, you can apply the filter on each column.

In [470]:
randframe[(np.abs(randframe) > (3*randframe.std())).any(axis=1)]

            0         1         2
125 -4.078494  1.592809 -1.138135
196  0.017394  0.061482  3.323463
370 -3.193333  0.990642  0.534225
389 -0.271316 -3.631927  1.411895
402  1.115299  0.174360  3.574846
517 -0.763522  3.145205  0.531917
760 -3.348310  1.175635  0.101763
889 -0.231595  0.649891 -3.172382

# Permutation:
Permutation is a process that extract a portion of DataFrame by subjecting it to a determined array.  
The operations of permutation (random reordering) of a Series or the rows of a DataFrame are easy to do using __numpy.random.permutation()__ function.

In [471]:
nframe = pd.DataFrame(np.arange(25).reshape(5,5))

In [472]:
nframe

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

Now create an array of five integers from 0 to 4 arranged in random order with the __permutation()__ function. This will be the new order in which to set the values of a row of DataFrame ...

In [473]:
new_order = np.random.permutation(5)

In [474]:
new_order

array([2, 3, 4, 1, 0])

Now apply it to the DataFrame on all lines, using the __take()__ function.

In [475]:
nframe.take(new_order)

    0   1   2   3   4
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
1   5   6   7   8   9
0   0   1   2   3   4

As you can see, the order of the rows has been changed; now the indices follow the same order as indicated in the __new_order__ array.   
You can submit even a portion of the entire DataFrame to a permutation. It generates an array that has a sequence limited to a certain range, for example, in our case from 2 to 4.

In [476]:
new_order = [3,4,2]

In [477]:
nframe.take(new_order)

    0   1   2   3   4
3  15  16  17  18  19
4  20  21  22  23  24
2  10  11  12  13  14

### Random Sampling:
You have just seen how to extract a portion of the DataFrame determined by subjecting it to permutation.  
Sometimes, when you have a huge DataFrame, you may have the need to sample it randomly, and the quickest way to do this is by using the __np.random.randomint()__

In [478]:
sample =  np.random.randint(0, len(nframe), size=3)

In [479]:
sample

array([1, 0, 2])

In [480]:
nframe.take(sample)

    0   1   2   3   4
1   5   6   7   8   9
0   0   1   2   3   4
2  10  11  12  13  14

As you can see from this random sampling you can get the same sample even more times

# String Manipulation:
Python is a popular language thanks to its ease of use in the processing of strings and text. Most operations can easily be made by using built-in functions provided by Python.  
For more complex cases of matching and manipulating, it is necessary the use of regular expressions.  
### Built-in Methods for Manipulation of Strings:
In many cases you have composite strings in which you would like to separate the various parts  and then assign them to the correct variables.  
The __split()__ function allows us to separate parts of a text, taking as reference point a separator, for example comma.

In [481]:
text = '16 Bolton Avenue , Boston'
text.split(',')
# there is a space after 'Avenue'

['16 Bolton Avenue ', ' Boston']

As we can see in the first element, you have a string with a space character at the end. To overcome this problem and often a frequent problem, you have to use the __split()__ function along with the __strip()__ function that takes care of doing the trim of whitespace (including newlines)

In [482]:
tokens = [s.strip() for s in text.split(',')]
tokens
# List comprehension ...
# this is a list comprehension that iterates over each 
# substring (s) generated by  text.split(',')
# for each substring (s), the strip() function
# removes any leading or trailing whitespaces from the string ...
# the space after 'Avenue' has been removed ...

['16 Bolton Avenue', 'Boston']

The result is an array of strings. If the number of elements is small and always the same, a very interesting way to make assignments may be this.

In [483]:
address, city = [s.strip() for s in text.split(',')]

In [484]:
address

'16 Bolton Avenue'

In [485]:
city

'Boston'

So far you have seen how to split a text into parts, but often you also need the opposite, namely concatenating various strings between them to form extended text.   
The most intuative and simple way is to concatenate the various text with the operatoe '+'.

In [486]:
address + ', ' + city

'16 Bolton Avenue, Boston'

This can be useful when you have only two or three strings to be concatenated. If the parts to be concatenated are much more, a more practical approach in this case will be to use the __join()__ function assigned to the separator character, with which you want to join the various strings between them.

In [487]:
strings = ['A+','A','A-','B','BB','BBB','C+']
' ; '.join(strings)

'A+ ; A ; A- ; B ; BB ; BBB ; C+'

Another category of operations that can be performed on the string is the search for pieces of text in them, i.e, substrings. Python provides, in the respect, the keyword which represents the best way of detecting substrings.

In [488]:
'Boston' in text

True

However, there are two functions that could serve to this purpose : __index()__ and __find()__

In [489]:
text.index('Boston')

19

In [490]:
text.find('Bolton')

3

In both cases, it returns the number of the corresponding character in the text where you have the substring. The difference in the behavior of these two functions can be seen, however, when the substring is not found:

In [491]:
text.index('New York')

ValueError: substring not found

In [492]:
text.find('New York')

-1

In fact, the __index()__ function returns an error message, and __find()__ returns -1 if the substring is not found. In the same area you can know how many times a character or a combination of characters (substring) occurs within a text.   
The __count()__ function provides you with this number.

In [493]:
text.count('o')

4

In [494]:
text.count('Avenue')

1

Another operation that can be performed on strings is the replacement or elimination of substring (or a single character). In both cases you will use the __replace()__ function, where if you are prompted to replace a substring with a balnk character, the operation will be equivalent to the elimination of the substring from the text.

In [495]:
text

'16 Bolton Avenue , Boston'

In [496]:
text.replace('Avenue', 'Plaza')

'16 Bolton Plaza , Boston'

In [497]:
text.replace('16', '')

' Bolton Avenue , Boston'

### Regular Expressions:
The regular expressions provide a very flexible way to search and match string patterns within a text. A single expressions, generally called __regex__, is a string formed according to the regular expression language. There is a built-in Python module called __re__, which is responsible for the operation of the __regex__.  
First you need to import the module.

In [498]:
import re

The __re__ module provides a set of functions that can be divided into three different categories.    
• pattern matching  
• substitution  
• splitting  

\s+ : expressing the sequence of one or more whitespaces characters.  

As you saw in the previous section, to split a text into parts through a separator character you can use the __split()__ function.  
there is a __split()__ function even for the __re__ module that performs the same operations, only it is able to accept a regex pattern as the criterion of separation, which makes it considerably more flexible.

In [499]:
text = "This is an odd  text!"

In [500]:
text

'This is an odd  text!'

In [501]:
re.split('\s+', text)

['This', 'is', 'an', 'odd', 'text!']

But analyze more deeply the mechnism of the __re__ module. When you call the __re.split()__ function, the regular expression is first compiled, then subsequntly calls the __split()__ function on the text argument. You can compile the regex function with the __re.compile()__ function, thus obtaining a reusable object regex and so gaining in term of CPU cycles.  
This is specially true in the operations of iterative search of a substring in a set or an array of strings.

In [502]:
regex = re.compile('\s+')

So if you make an __regex__ object with the __compile()__ function, you can apply __split()__ directly to it in the following way.

In [503]:
regex.split(text)

['This', 'is', 'an', 'odd', 'text!']

__findall()__ function returns a list of all the substrings in the text that meet the requirements of the regex.  
for example, if you want to find in a string all the words with "A" uppercase, or for example, with "a" regardless whether upper- or lowercase, you need to enter that follows:

In [504]:
text = "This is my address: 16 Bolton Avenue, Boston"

In [505]:
re.findall('A\w+', text)

['Avenue']

In [506]:
re.findall('[A,a]\w+', text)

['address', 'Avenue']

There are two other functions related to the function __findall()__: __match()__ and __search()__.  
while __findall()__ returns all matches within a list, the function __search()__ returns only the furst match. Furthermore, the object returned by this function is a particular object:

In [507]:
re.search('[A,a]\w+', text)

This object dose not contain the value of the substring that responds to the regex pattern, but its start and end positions within the string.

In [508]:
search = re.search('[A,a]\w+', text)

In [509]:
search.start()

11

In [510]:
search.end()

18

In [511]:
text[search.start():search.end()]

'address'

The __match()__ function performs the matching only at the beginning of the string; if there is no match with the first character, it goes no further in search within the string. If you do not find any match then it will not return any objects.

In [512]:
re.match('[A,a]\w+', text)

If __match()__ has a response, then it returns an object identical to what you saw for the __search()__ function.

In [513]:
re.match('T\w+', text)

In [514]:
match = re.match('T\w+', text)

In [515]:
text[match.start():match.end()]

'This'

# Data Aggrigation:  
The last stage of data manipulation is data aggregation you generally mean a transformation that produces a single integer from an array.  
In fact, you have already made many operations of data aggregation, for example when we calculated the __sum()__, __mean()__ and __count()__. In fact, these functions operate on a set of data and shall perform a calculation with a consistent result consisting of a single value.  
However, a more formal manner and the one with more control in data aggregation is that which includes the __categorization__ of a set.  

The __Categorization__ of a set of data carried out for grouping is often a critical stage in the process of data analysis. It is a process of transformation since after the division into different groups, you apply a function that converts or transforms the data in some way depending on the group they belong to.  
Very often the two phases of grouping and application of a function are performed in a single step.  
Also for this part of data analysis, pandas provides a tool very flesxible and high performance:
__GroupBy__.   

Again, as in the case of join, those familiar with relational databases and the SQL language can find similarities. Nevertheless, languages such as SQL are quite limited when applied to operations on groups. In fact, given the flexiblity of a programming languages like Python, with all the libraries avaliable, especially pandas, you can perform very complex operations on groups.

### GroupBy:
Now you will analyze in detail what the process of __GroupBy__ is and how it works. Generally, it refers to its internal mechanism as a process called __SPLIT-APPLY-COMBINE__. So in its pattern of operation you may conceive this process as divided into three different phases expressed precisely by three operations:  
 • splitting: division into groups of data sets.  
 • applying: application of a function on each         group.  
 • combining: combination of all the resultsobtained by different groups.

In [516]:
frame = pd.DataFrame({ 'color': ['white','red','green','red','green'],
... 'object': ['pen','pencil','pencil','ashtray','pen'],
... 'price1' : [5.56,4.20,1.30,0.56,2.75],
... 'price2' : [4.75,4.12,1.60,0.75,3.15]})

In [517]:
frame

   color   object  price1  price2
0  white      pen    5.56    4.75
1    red   pencil    4.20    4.12
2  green   pencil    1.30    1.60
3    red  ashtray    0.56    0.75
4  green      pen    2.75    3.15

suppose you need to calculate the average __price1__ column using group labels listed in the column color.  
There are several ways to do this. You can for example access the __price1__ column and call the __groupby()__ function with the column color.

In [518]:
group = frame['price1'].groupby(frame['color'])

In [519]:
group

The object that we got is a __GroupBy__  object. In the operation that you just did there was not really any calculation; there was just a collection of all the information needed to calculate to be executed. What you have done is in fact a process of grouping, in which all rows having the same value of color are grouped into a single item.

To analyze in detail how the division into groups of rows of DataFrame was made, you call the attribute groups GroupBy object.

In [520]:
group.groups

{'green': [2, 4], 'red': [1, 3], 'white': [0]}

As you can see, each group is listed explicitly specifying the rows of the data frame assigned to each of them. Now it is sufficient to apply the operation on the group to obtain the results for each individual group.

In [521]:
group.mean()

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [522]:
group.sum()

color
green    4.05
red      4.76
white    5.56
Name: price1, dtype: float64

### Hierarical Grouping:  
You have seen how to group the data according to the values of a column as a key choice. The same thing can be extended to multiple columns,i.e, make a grouping of multiple keys hierarical.

In [523]:
ggroup = frame['price1'].groupby([frame['color'], frame['object']])

In [524]:
ggroup.groups

{('green', 'pen'): [4], ('green', 'pencil'): [2], ('red', 'ashtray'): [3], ('red', 'pencil'): [1], ('white', 'pen'): [0]}

In [525]:
ggroup.sum()

color  object
green  pen        2.75
       pencil     1.30
red    ashtray    0.56
       pencil     4.20
white  pen        5.56
Name: price1, dtype: float64

So far you have applied the grouping to a single column of data, but in reality it can be extended to a multiple columns or the entire data frame. Also if you do not need to reuse the object GroupBy several times, it is convenient to combine in a single passing all of the grouping and calculation to be done, without defining any intermediate variable.

In [526]:
frame[['price1','price2']].groupby(frame['color']).mean()

       price1  price2
color
green   2.025   2.375
red     2.380   2.435
white   5.560   4.750

In [527]:
frame[['price1','price2']].groupby(frame['color']).mean()

       price1  price2
color
green   2.025   2.375
red     2.380   2.435
white   5.560   4.750

# Group Iteration:
The __GroupBy__ object supports the operation of an iteration for generating a sequence of 2-tuples containing the name of the group together with the data portion.

In [528]:
for name, group in frame.groupby('color'):
    print (name)
    print (group)

green
   color  object  price1  price2
2  green  pencil    1.30    1.60
4  green     pen    2.75    3.15
red
  color   object  price1  price2
1   red   pencil    4.20    4.12
3   red  ashtray    0.56    0.75
white
   color object  price1  price2
0  white    pen    5.56    4.75

In the example you have seen, you only applied the print variable for illustration. In fact, you replace the printing operation of a variable with the function to be applied on it.

### Chain of Transformation:
From these examples you have seen that for each grouping, when subjected to some function calculations or other operations in general, regardless of how it was obtained and selection criteria, the result will be a data structure Series (if we selected a single column data) or a DataFrame, which then retains the index system and the name of the columns.

In [529]:
result1 = frame['price1'].groupby(frame['color']).mean()

In [530]:
type(result1)

pandas.core.series.Series

In [531]:
result1 #Series

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [532]:
result2 = frame[['price1', 'price2']].groupby(frame['color']).mean()

In [533]:
type(result2)

pandas.core.frame.DataFrame

In [534]:
result2 #DataFrame

       price1  price2
color
green   2.025   2.375
red     2.380   2.435
white   5.560   4.750

So it is possible to select a single column at any point in the various phases of this process. Here are three cases in which the selection of a single column in three different stages of the process applies. This example illustrates the great flexability of this system of grouping peovided by pandas.

In [535]:
frame['price1'].groupby(frame['color']).mean()

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [536]:
frame.groupby(frame['color'])['price1'].mean()

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In addition, after an operation of aggregation the names of some columns may not be very meaningful in certain cases. In fact it is often useful to add a prefix to the column name that describes the type of business combination.  
Adding a prefix, instead of completely replacing the name, is very useful for keeping track of the source data from which they are derived aggregated values.  
This is important if you apply a process of transfromation chain (a series of DataFrame is generated from each other) in which it is important to somehow keep some reference with the source data.

In [537]:
frame

   color   object  price1  price2
0  white      pen    5.56    4.75
1    red   pencil    4.20    4.12
2  green   pencil    1.30    1.60
3    red  ashtray    0.56    0.75
4  green      pen    2.75    3.15

In [538]:
means = frame.groupby(frame['color'])[['price1','price2']].mean().add_prefix('mean_')

In [539]:
means

       mean_price1  mean_price2
color
green        2.025        2.375
red          2.380        2.435
white        5.560        4.750

### Functions of Groups:
Although many methods have not been implemented specifically for use with __GroupBy__, they actually work correctly with data structures as the Series. You saw in the previous section how easy it is to get the Series by a GroupBy object, specifying the name of the column and then by applying the method to make the calculation.  
For example, you can use the calculation quantiles with the __quantiles()__ function.

In [540]:
group = frame.groupby('color')

In [541]:
group['price1'].quantile(0.6)

color
green    2.170
red      2.744
white    5.560
Name: price1, dtype: float64

You can also define their own aggregation functions. Define the function separately and then you pass as an argument to the __mark()__ function.  
For example, you could calculate the range of values of each group.

In [542]:
def range(series):
    return series.max() - series.min()

In [543]:
group['price1'].agg(range)

color
green    1.45
red      3.64
white    0.00
Name: price1, dtype: float64

The __agg()__ function allows you to use aggregate functions on an entire DataFrame.

In [544]:
group[['price1','price2']].agg(range)

       price1  price2
color
green    1.45    1.55
red      3.64    3.37
white    0.00    0.00

Also you can use more aggregate functions at the same time always with the __mark()__ function passing an array containing the list of operations to be done, which will become the new columns.

In [545]:
group['price1'].agg(['mean','std',range])

        mean       std  range
color
green  2.025  1.025305   1.45
red    2.380  2.573869   3.64
white  5.560       NaN   0.00

In [546]:
group[['price1','price2']].agg(['mean','std',range])

      price1                 price2
        mean       std range   mean       std range
color
green  2.025  1.025305  1.45  2.375  1.096016  1.55
red    2.380  2.573869  3.64  2.435  2.382950  3.37
white  5.560       NaN  0.00  4.750       NaN  0.00

# Advanced Data Aggregation:
In this section you will introduced to __transformation()__ and __apply()__ functions, which will allow you to perform many kinds of group operations, some very complex.  
Now suppose we wnat to bring together the same DataFrame the following:  
(i) The DataFrame of origin (the one containing the data).  
(ii) That obtained by the calculation of group aggregation, for example, the sum.

In [547]:
frame = pd.DataFrame({ 'color':['white','red','green','red','green'],
... 'price1':[5.56,4.20,1.30,0.56,2.75],
... 'price2':[4.75,4.12,1.60,0.75,3.15]})

In [548]:
frame

   color  price1  price2
0  white    5.56    4.75
1    red    4.20    4.12
2  green    1.30    1.60
3    red    0.56    0.75
4  green    2.75    3.15

In [549]:
sums = frame.groupby(frame['color']).sum().add_prefix('tot_')

In [550]:
sums

       tot_price1  tot_price2
color
green        4.05        4.75
red          4.76        4.87
white        5.56        4.75

In [551]:
sums = frame.groupby(frame['color'])['price1'].sum().add_prefix('tot_')

In [552]:
sums

color
tot_green    4.05
tot_red      4.76
tot_white    5.56
Name: price1, dtype: float64

In [553]:
sums = frame.groupby(frame['color'])['price1'].sum().rename('tot_price1').reset_index()

In [554]:
sums

   color  tot_price1
0  green        4.05
1    red        4.76
2  white        5.56

In [555]:
print(sums.to_string(index=False))

color  tot_price1
green        4.05
  red        4.76
white        5.56

In [556]:
sums

   color  tot_price1
0  green        4.05
1    red        4.76
2  white        5.56

In [557]:
tot_price1 = frame.groupby('color')['price1'].sum().rename('tot_price1')

In [558]:
tot_price2 = frame.groupby('color')['price2'].sum().rename('tot_price2')

In [559]:
sums

   color  tot_price1
0  green        4.05
1    red        4.76
2  white        5.56

In [560]:
result=pd.merge(frame,tot_price1,left_on='color',right_index=True)

result=pd.merge(frame,tot_price2,left_on='color',right_index=True)

print(result)

   color  price1  price2  tot_price2
0  white    5.56    4.75        4.75
1    red    4.20    4.12        4.87
3    red    0.56    0.75        4.87
2  green    1.30    1.60        4.75
4  green    2.75    3.15        4.75

In [561]:
import pandas as pd

# Original DataFrame
frame = pd.DataFrame({
    'color': ['white', 'red', 'green', 'red', 'green'],
    'price1': [5.56, 4.20, 1.30, 0.56, 2.75],
    'price2': [4.75, 4.12, 1.60, 0.75, 3.15]
})

# Group and calculate totals
tot_price1 = frame.groupby('color')['price1'].sum().rename('tot_price1')
tot_price2 = frame.groupby('color')['price2'].sum().rename('tot_price2')

# Merge the first total
result = pd.merge(frame, tot_price1, left_on='color', right_index=True)

# Merge the second total
result = pd.merge(result, tot_price2, left_on='color', right_index=True)

print(result)

   color  price1  price2  tot_price1  tot_price2
0  white    5.56    4.75        5.56        4.75
1    red    4.20    4.12        4.76        4.87
3    red    0.56    0.75        4.76        4.87
2  green    1.30    1.60        4.05        4.75
4  green    2.75    3.15        4.05        4.75

So thanks to the __merge()__, you managed to add the results of a calculation of aggregation in each line of the DataFrame to start. But actually there is another way to do this type of operation. That is by using the __transform()__. This function performs the calculation of aggregation as you have seen before, but at the same time shows the values calculated based on the key value on each line of the DataFrame to start.

In [562]:
import numpy as np

In [563]:
frame.groupby('color').transform(np.sum).add_prefix('tot_')

   tot_price1  tot_price2
0        5.56        4.75
1        4.76        4.87
2        4.05        4.75
3        4.76        4.87
4        4.05        4.75

As you can see the __transform()__ method specialized function that has very specific requirements: the function passed as an argument must produce a single scalar value (aggrgation) to be broadcasted.

The method to cover more general GroupBy is applicable to __apply()__. This method applies in its entirety the scheme split-apply-combine. In fact, this function divides the object into parts in order to be manipulated, invokes the passage of function on each piece, and then tries to chain together the various parts.

In [564]:
frame = pd.DataFrame( { 'color':['white','black','white','white','black','black'],
... 'status':['up','up','down','down','down','up'],
... 'value1':[12.33,14.55,22.34,27.84,23.40,18.33],
... 'value2':[11.23,31.80,29.99,31.18,18.25,22.44]})

In [565]:
frame

   color status  value1  value2
0  white     up   12.33   11.23
1  black     up   14.55   31.80
2  white   down   22.34   29.99
3  white   down   27.84   31.18
4  black   down   23.40   18.25
5  black     up   18.33   22.44

In [566]:
frame.groupby(['color','status']).apply(lambda x:x.max())

              color status  value1  value2
color status
black down    black   down   23.40   18.25
      up      black     up   18.33   31.80
white down    white   down   27.84   31.18
      up      white     up   12.33   11.23

In [567]:
frame

   color status  value1  value2
0  white     up   12.33   11.23
1  black     up   14.55   31.80
2  white   down   22.34   29.99
3  white   down   27.84   31.18
4  black   down   23.40   18.25
5  black     up   18.33   22.44

In [568]:
reindex = {0: 'first', 1:'second', 2:'third', 3:'fourth',4:'fifth',5:'sixth'}

In [569]:
frame.rename(index=reindex)

        color status  value1  value2
first   white     up   12.33   11.23
second  black     up   14.55   31.80
third   white   down   22.34   29.99
fourth  white   down   27.84   31.18
fifth   black   down   23.40   18.25
sixth   black     up   18.33   22.44

In [570]:
temp = pd.date_range('12/06/2024', periods=10, freq='H')

In [571]:
temp

DatetimeIndex(['2024-12-06 00:00:00', '2024-12-06 01:00:00',
               '2024-12-06 02:00:00', '2024-12-06 03:00:00',
               '2024-12-06 04:00:00', '2024-12-06 05:00:00',
               '2024-12-06 06:00:00', '2024-12-06 07:00:00',
               '2024-12-06 08:00:00', '2024-12-06 09:00:00'],
              dtype='datetime64[ns]', freq='H')

In [572]:
timeseries = pd.Series(np.random.rand(10), index=temp)

In [573]:
timeseries

2024-12-06 00:00:00    0.937479
2024-12-06 01:00:00    0.286185
2024-12-06 02:00:00    0.933360
2024-12-06 03:00:00    0.406129
2024-12-06 04:00:00    0.216975
2024-12-06 05:00:00    0.430628
2024-12-06 06:00:00    0.849103
2024-12-06 07:00:00    0.333514
2024-12-06 08:00:00    0.107547
2024-12-06 09:00:00    0.719963
Freq: H, dtype: float64

In [574]:
timetable = pd.DataFrame( {'date': temp, 'value1' : np.random.rand(10),
... 'value2' : np.random.rand(10)})

In [575]:
timetable

                 date    value1    value2
0 2024-12-06 00:00:00  0.074599  0.507956
1 2024-12-06 01:00:00  0.924956  0.047119
2 2024-12-06 02:00:00  0.695631  0.273885
3 2024-12-06 03:00:00  0.334812  0.003628
4 2024-12-06 04:00:00  0.179927  0.698406
5 2024-12-06 05:00:00  0.854949  0.022060
6 2024-12-06 06:00:00  0.064615  0.830684
7 2024-12-06 07:00:00  0.208654  0.990387
8 2024-12-06 08:00:00  0.086680  0.089906
9 2024-12-06 09:00:00  0.267486  0.038139

In [576]:
timetable['cat'] = ['up','down','left','left','up','up','down','right','right','up']

In [577]:
timetable

                 date    value1    value2    cat
0 2024-12-06 00:00:00  0.074599  0.507956     up
1 2024-12-06 01:00:00  0.924956  0.047119   down
2 2024-12-06 02:00:00  0.695631  0.273885   left
3 2024-12-06 03:00:00  0.334812  0.003628   left
4 2024-12-06 04:00:00  0.179927  0.698406     up
5 2024-12-06 05:00:00  0.854949  0.022060     up
6 2024-12-06 06:00:00  0.064615  0.830684   down
7 2024-12-06 07:00:00  0.208654  0.990387  right
8 2024-12-06 08:00:00  0.086680  0.089906  right
9 2024-12-06 09:00:00  0.267486  0.038139     up

The example shown above, however, has duplicate key value ...

We add to the DataFrame preceding a column that represents a set of text values that we will use as a key values

 # Conclusions:
 In this chapter you saw the three basic parts which divide the data manipulation: preparation, processing, and data aggregation. Thanks to a series of examples you've got to know a set of library functions that allow pandas to perform these operations.  
 You saw how to apply these functions on simple data structures so that you can become familiar with how they work  and understand its applicability to more complex cases.  
 Eventually you get knowledge of all the tools necessary to prepare a data set for the next phase of data analysis: __data visualisation__.  
 In the next chapter, you will be presented with the Python library __Matplotlib__, which can convert the data structures in any chart.

Great ...  
Good Bye